#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_string.random: Refreshing state... [id=sZHL]
data.archive_file.layer_zip: Reading...
data.archive_file.lambda_zip: Reading...
data.archive_file.lambda_zip: Read complete after 0s [id=656ba3ddc31623895e249ad75e1db7880946b8ed]
aws_apigatewayv2_api.http_lambda: Refreshing state... [id=exj5m66tib]
aws_dynamodb_table.paste: Refreshing state... [id=paste]
aws_iam_policy.lambda_exec_role: Refreshing state... [id=arn:aws:iam::127449185323:policy/lambda-tf-pattern-ddb-post]
aws_cloudwatch_log_group.api_gw: Refreshing state... [id=/aws/api_gw/pastebin-sZHL]
aws_s3_bucket.lambda_bucket: Refreshing state... [id=pastebin20231223003519593600000001]
aws_iam_role.lambda_exec: Refreshing state... [id=LambdaDdbPost]
aws_cloudwatch_log_group.lambda_logs: Refreshing state... [id=/aws/lambda/pastebin-sZHL]
aws_sns_topic.budget_notification: Refreshing state... [id=arn:aws:sns:ca-central-1:127449185323:BudgetNotificationTopic]
data.archive_file.layer_zip: Read complete after 1s [id=bc8f5056c5b4728346250ad8e445db4367d6e1db]
aws_lambda_layer_version.dependencies_layer: Refreshing state... [id=arn:aws:lambda:ca-central-1:127449185323:layer:python-layer:29]
aws_sns_topic_subscription.email_subscription: Refreshing state... [id=arn:aws:sns:ca-central-1:127449185323:BudgetNotificationTopic:6fac9d94-197f-4a31-b6ee-8c9702c91d24]
aws_cloudwatch_metric_alarm.budget_alarm: Refreshing state... [id=MonthlyChargeAlarm]
aws_iam_role_policy_attachment.lambda_policy: Refreshing state... [id=LambdaDdbPost-20231223010623714500000001]
aws_s3_bucket_ownership_controls.lambda_bucket: Refreshing state... [id=pastebin20231223003519593600000001]
aws_s3_object.this: Refreshing state... [id=src.zip]
aws_s3_bucket_acl.private_bucket: Refreshing state... [id=pastebin20231223003519593600000001,private]
aws_lambda_function.apigw_lambda_ddb: Refreshing state... [id=pastebin-sZHL]
aws_lambda_permission.api_gw: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_apigatewayv2_integration.apigw_lambda: Refreshing state... [id=v3fnxm6]
aws_apigatewayv2_route.write["POST /paste"]: Refreshing state... [id=arq6oei]
aws_apigatewayv2_route.read["GET /paste/api"]: Refreshing state... [id=95ed56b]
aws_apigatewayv2_route.write["POST /paste/api"]: Refreshing state... [id=eicvmug]
aws_apigatewayv2_route.read["GET /paste"]: Refreshing state... [id=pd3pcd6]
aws_apigatewayv2_route.read["OPTIONS /paste"]: Refreshing state... [id=1y3pfqk]
aws_apigatewayv2_stage.default: Refreshing state... [id=$default]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lambda_function.apigw_lambda_ddb will be updated in-place
  ~ resource "aws_lambda_function" "apigw_lambda_ddb" {
        id                             = "pastebin-sZHL"
      ~ last_modified                  = "2024-04-07T19:39:54.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:127449185323:layer:python-layer:29",
        ] -> (known after apply)
      ~ source_code_hash               = "wIdHxJDGXlQ7ei9UWvbYsX1jjxhegAgLHwdWkInLTKM=" -> "BrVdsz8+pMYePYaCkD962hw+c+fdZ9NNIDN3INoJAfc="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.dependencies_layer must be replaced
-/+ resource "aws_lambda_layer_version" "dependencies_layer" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:127449185323:layer:python-layer:29" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2024-04-07T19:39:54.063+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:127449185323:layer:python-layer:29" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:127449185323:layer:python-layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "+75tMa3T6ILWbTBzEo4BfB2kK/D22b9cf4Dn5Bc0lGk=" -> "+u3qR8pIVbSo8oEN+dLDSNEzqI1K1Ra3XYmbVETIAYI=" # forces replacement
      ~ source_code_size            = 16575183 -> (known after apply)
      ~ version                     = "29" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_s3_object.this will be updated in-place
  ~ resource "aws_s3_object" "this" {
      ~ etag                   = "4fcc12208f9cd4db57f726ef7b1ce50e" -> "11d90da4349a2e7b262fa39dca854336"
        id                     = "src.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pushed by: @socraticDevBlog, Action: `pull_request`*